## 16.05. Как сделать рамку окна основного описания?
<!-- [:faq_16_05] -->

В: Как сделать рамку окна основного описания?
	Как сделать, чтобы картинки шли по контуру основного окна?

О:
Пользуясь табличной вёрсткой в классическом плеере, можно добиться подобного эффекта. Для этого необходимо создать таблицу с шириной в 100% окна и в крайние левые, правые и верхние ячейки поместить нужные изображения. Можно так же поместить изображение в крайнюю нижнюю ячейку, но оно не будет "пристыковано" к нижнему краю основного окна, а окажется в пределах содержимого. Ещё крайние левые и крайние правые изображения нельзя растянуть по высоте на 100%, а значит добиться их поведения именно как границ рамки будет невозможно (они не будут растягиваться и сжиматься в зависимости от содержимого).

Более гибкие и простые настройки оформления есть в qSpider. Там можно добиться гораздо более изящного внешнего вида окна основного описания.
