1. Устанваливаем GIT (https://zencod.ru/articles/first-step-git). Для Windows (https://git-scm.com/download/win):
	* Скачиваем приложение
	* Запускаем установку
	* После установки можно сразу запустить git-CMD
	* производим настройку своего профиля вводя в терминал поочереди команды:

		git config --global user.name "ВАШЕ_ИМЯ"
		git config --global user.email АДРЕС

	Заменив значения ВАШЕ_ИМЯ и АДРЕС вашими значениями.

	После указания своих данных, можно их просмотреть:

		git config --global --list
	
	Обратите внимание, что в командах, указанных выше, есть опция --global. Это значит, что такие данные будут сохранены для всех ваших действий в Git и вводить их больше не надо. Если вы хотите менять эту информацию для разных проектов, то в директории проекта вводите эти же команды, только без опции --global.

2. Открываем VS Code. 